// 862 - 1480
export const questions862_1480 = [
    {
        id: 1,
        question: "Какой князь, согласно 'Повести временных лет', был призван на княжение в 862 году, что положило начало династии Рюриковичей?",
        image: "",
        options: [
            {
                option: "Олег Вещий",
                isCorrect: false
            },
            {
                option: "Рюрик",
                isCorrect: true
            },
            {
                option: "Дир",
                isCorrect: false
            },
            {
                option: "Аскольд",
                isCorrect: false
            },
        ],
        explanation: "Летопись сообщает о призвании варяга Рюрика с братьями для прекращения междоусобиц. Это событие считается условным началом русской государственности."
    },
    {
        id: 2,
        question: "Какое событие произошло в 988 году и оказало решающее влияние на культуру и международные связи Древней Руси?",
        image: "",
        options: [
            {
                option: "Принятие ислама",
                isCorrect: false
            },
            {
                option: "Крещение Руси князем Владимиром",
                isCorrect: true
            },
            {
                option: "Перенесение столицы в Киев",
                isCorrect: false
            },
            {
                option: "Создание 'Русской Правды'",
                isCorrect: false
            },
        ],
        explanation: "Князь Владимир Святославич принял христианство из Византии и начал процесс крещения населения. Это определило духовное развитие страны и включило её в круг византийской (православной) цивилизации."
    },
    {
        id: 3,
        question: "При каком князе Древнерусское государство достигло своего наивысшего могущества и размера?",
        image: "",
        options: [
            {
                option: "Владимир Мономах",
                isCorrect: false
            },
            {
                option: "Ярослав Мудрый",
                isCorrect: true
            },
            {
                option: "Иван Калита",
                isCorrect: false
            },
            {
                option: "Святослав Игоревич",
                isCorrect: false
            },
        ],
        explanation: "При Ярославе Мудром (1019-1054) Киевская Русь достигла пика своего культурного и политического расцвета, был создан первый письменный свод законов 'Русская Правда'."
    },
    {
        id: 4,
        question: "Какая битва, состоявшаяся в 1242 году, связана с именем князя Александра Невского и остановила продвижение крестоносцев на восток?",
        image: "",
        options: [
            {
                option: "Битва на реке Калке",
                isCorrect: false
            },
            {
                option: "Ледовое побоище (битва на Чудском озере)",
                isCorrect: true
            },
            {
                option: "Куликовская битва",
                isCorrect: false
            },
            {
                option: "Битва на реке Сити",
                isCorrect: false
            },
        ],
        explanation: "Александр Невский разгромил войско Ливонского ордена на льду Чудского озера. Эта победа обеспечила безопасность северо-западных рубежей Руси в период монгольского владычества."
    },
    {
        id: 5,
        question: "Кто из московских князей первым получил от ордынских ханов право самостоятельно собирать дань с русских земель?",
        image: "",
        options: [
            {
                option: "Дмитрий Донской",
                isCorrect: false
            },
            {
                option: "Юрий Долгорукий",
                isCorrect: false
            },
            {
                option: "Иван Калита",
                isCorrect: true
            },
            {
                option: "Иван III",
                isCorrect: false
            },
        ],
        explanation: "Иван I Калита (1325-1340) заслужил доверие Орды. Ярлык на сбор дани укрепил экономическое и политическое влияние Москвы."
    },
    {
        id: 6,
        question: "Какое сражение, произошедшее в 1380 году, стало первым крупным поражением Золотой Орды и укрепило авторитет Москвы?",
        image: "",
        options: [
            {
                option: "Битва на реке Воже",
                isCorrect: false
            },
            {
                option: "Битва при Грюнвальде",
                isCorrect: false
            },
            {
                option: "Куликовская битва",
                isCorrect: true
            },
            {
                option: "Стояние на реке Угре",
                isCorrect: false
            },
        ],
        explanation: "В Куликовской битве объединённое русское войско под командованием московского князя Дмитрия Донского разбило войско темника Мамая. Хотя иго не было свергнуто, эта победа имела огромное моральное значение."
    },
    {
        id: 7,
        question: "Какой великий князь завершил объединение русских земель вокруг Москвы и положил конец ордынскому владычеству в 1480 году?",
        image: "",
        options: [
            {
                option: "Василий II Тёмный",
                isCorrect: false
            },
            {
                option: "Иван III Великий",
                isCorrect: true
            },
            {
                option: "Василий III",
                isCorrect: false
            },
            {
                option: "Иван IV Грозный",
                isCorrect: false
            },
        ],
        explanation: "Иван III (1462-1505) присоединил Новгород, Тверь и другие земли. В 1480 году после 'Стояния на реке Угре' хан Ахмат отступил, что означало окончательное освобождение Руси от ордынской зависимости."
    },
    {
        id: 8,
        question: "Какой свод законов, созданный в 1497 году, положил начало закрепощению крестьян, введя правило 'Юрьева дня'?",
        image: "",
        options: [
            {
                option: "'Русская Правда'",
                isCorrect: false
            },
            {
                option: "'Судебник' Ивана III",
                isCorrect: true
            },
            {
                option: "'Соборное Уложение'",
                isCorrect: false
            },
            {
                option: "'Стоглав'",
                isCorrect: false
            },
        ],
        explanation: "'Судебник' Ивана III установил единые правовые нормы. Впервые был ограничен переход крестьян от одного землевладельца к другому двумя неделями в году (неделя до и после осеннего Юрьева дня)."
    },
    {
        id: 9,
        question: "Что стало результатом битвы на реке Калке в 1223 году для русских князей?",
        image: "",
        options: [
            {
                option: "Блестящая победа над монголами",
                isCorrect: false
            },
            {
                option: "Первое столкновение с монголами, закончившееся катастрофическим поражением",
                isCorrect: true
            },
            {
                option: "Заключение союза с монголами против половцев",
                isCorrect: false
            },
            {
                option: "Остановка монгольского нашествия на 50 лет",
                isCorrect: false
            },
        ],
        explanation: "На Калке объединённое войско русских князей и половцев потерпело сокрушительное поражение от передовых отрядов монголов. Разобщённость и отсутствие единого командования стали главными причинами трагедии."
    },
    {
        id: 10,
        question: "Какой город на протяжении более двух веков (1136-1478 гг.) был центром самостоятельной боярской республики, где главным органом власти было народное вече?",
        image: "",
        options: [
            {
                option: "Псков",
                isCorrect: false
            },
            {
                option: "Новгород",
                isCorrect: true
            },
            {
                option: "Смоленск",
                isCorrect: false
            },
            {
                option: "Полоцк",
                isCorrect: false
            },
        ],
        explanation: "Господин Великий Новгород — крупнейшая торговая республика. Управлялся вечем, которое приглашало князя на военную службу. Был присоединён к Москве Иваном III после Шелонской битвы."
    }
];

// 1480–1613
export const questions1480_1613 = [
    {
        id: 1,
        question: "Какой русский царь, правивший с 1533 по 1584 год, известен своими реформами, созданием стрелецкого войска и завоеванием Казанского и Астраханского ханств?",
        image: "",
        options: [
            {
                option: "Василий III",
                isCorrect: false
            },
            {
                option: "Иван IV Грозный",
                isCorrect: true
            },
            {
                option: "Фёдор I Иоаннович",
                isCorrect: false
            },
            {
                option: "Борис Годунов",
                isCorrect: false
            },
        ],
        explanation: "Иван IV (Грозный) был первым русским правителем, официально венчанным на царство (1547). Его правление отмечено масштабными реформами (Избранная рада) и крупными военными успехами на востоке."
    },
    {
        id: 2,
        question: "Что представляла собой политика Ивана IV Грозного, проводившаяся в 1565–1572 годах и сопровождавшаяся массовым террором, конфискациями земель и созданием особого удела царя?",
        image: "",
        options: [
            {
                option: "Опричнина",
                isCorrect: true
            },
            {
                option: "Местничество",
                isCorrect: false
            },
            {
                option: "Кормление",
                isCorrect: false
            },
            {
                option: "Земщина",
                isCorrect: false
            },
        ],
        explanation: "Опричнина — это система чрезвычайных мер, направленных на укрепление личной власти царя и борьбу с предполагаемой изменой. Привела к разорению страны, массовым казням и усилению крепостничества."
    },
    {
        id: 3,
        question: "Как называется период в истории России с 1598 по 1613 год, характеризующийся катаклизмами, войной, иностранной интервенцией и острой династической борьбой?",
        image: "",
        options: [
            {
                option: "Смутное время",
                isCorrect: true
            },
            {
                option: "Эпоха дворцовых переворотов",
                isCorrect: false
            },
            {
                option: "Великая замятня",
                isCorrect: false
            },
            {
                option: "Междоусобная война",
                isCorrect: false
            },
        ],
        explanation: "Смутное время началось с пресечением династии Рюриковичей после смерти царя Фёдора Иоанновича. Включало правление Бориса Годунова, самозванцев, польско-шведскую интервенцию и глубокий кризис государственности."
    },
    {
        id: 4,
        question: "Кто был первым русским патриархом, избранным в 1589 году при царе Фёдоре Иоанновиче, что укрепило авторитет Русской православной церкви?",
        image: "",
        options: [
            {
                option: "Патриарх Никон",
                isCorrect: false
            },
            {
                option: "Патриарх Филарет",
                isCorrect: false
            },
            {
                option: "Патриарх Иов",
                isCorrect: true
            },
            {
                option: "Патриарх Гермоген",
                isCorrect: false
            },
        ],
        explanation: "Патриарх Иов стал первым предстоятелем автокефальной Русской православной церкви. Учреждение патриаршества стало важным шагом в становлении России как центра православного мира после падения Византии."
    },
    {
        id: 5,
        question: "Какой самозванец, поддержанный Польшей, захватил власть в Москве в 1605 году и правил почти год, выдав себя за сына Ивана Грозного?",
        image: "",
        options: [
            {
                option: "Лжедмитрий I",
                isCorrect: true
            },
            {
                option: "Лжедмитрий II",
                isCorrect: false
            },
            {
                option: "Лжепётр",
                isCorrect: false
            },
            {
                option: "Иван Болотников",
                isCorrect: false
            },
        ],
        explanation: "Лжедмитрий I (Григорий Отрепьев) был первым и самым успешным самозванцем Смуты. Его правление закончилось восстанием в Москве и убийством, организованным Василием Шуйским."
    },
    {
        id: 6,
        question: "Какое событие, произошедшее в 1610 году, привело к низложению царя Василия Шуйского и установлению в Москве власти правительства Семибоярщины?",
        image: "",
        options: [
            {
                option: "Осада Смоленска",
                isCorrect: false
            },
            {
                option: "Клушинская битва",
                isCorrect: true
            },
            {
                option: "Оборона Троице-Сергиева монастыря",
                isCorrect: false
            },
            {
                option: "Восстание Болотникова",
                isCorrect: false
            },
        ],
        explanation: "Поражение русско-шведской армии под Клушино от войск Речи Посполитой 24 июня 1610 года окончательно подорвало авторитет царя Василия Шуйского и открыло путь к Москве для польских войск."
    },
    {
        id: 7,
        question: "Какое народное ополчение, созданное в 1611 году в Нижнем Новгороде, освободило Москву от польско-литовских интервентов в 1612 году?",
        image: "",
        options: [
            {
                option: "Ополчение Прокопия Ляпунова",
                isCorrect: false
            },
            {
                option: "Второе (Нижегородское) ополчение Минина и Пожарского",
                isCorrect: true
            },
            {
                option: "Ополчение князя Трубецкого",
                isCorrect: false
            },
            {
                option: "Стрелецкое войско",
                isCorrect: false
            },
        ],
        explanation: "Второе ополчение, организованное земским старостой Кузьмой Мининым и возглавленное князем Дмитрием Пожарским, взяло штурмом Китай-город и освободило Москву от интервентов 4 ноября (22 октября) 1612 года."
    },
    {
        id: 8,
        question: "Какое событие в 1613 году считается завершением Смутного времени и началом новой царской династии?",
        image: "",
        options: [
            {
                option: "Деулинское перемирие",
                isCorrect: false
            },
            {
                option: "Избрание на царство Михаила Романова Земским собором",
                isCorrect: true
            },
            {
                option: "Освобождение Смоленска",
                isCorrect: false
            },
            {
                option: "Казнь Ивана Заруцкого",
                isCorrect: false
            },
        ],
        explanation: "Земский собор 1613 года избрал на царство 16-летнего Михаила Фёдоровича Романова, что положило конец династическому кризису и стало символом возрождения русской государственности."
    },
    {
        id: 9,
        question: "Какой важный законодательный акт 1550 года, принятый при Иване IV, систематизировал законы и усилил централизацию государства?",
        image: "",
        options: [
            {
                option: "Судебник Ивана III",
                isCorrect: false
            },
            {
                option: "Соборное Уложение",
                isCorrect: false
            },
            {
                option: "Судебник Ивана IV",
                isCorrect: true
            },
            {
                option: "Русская Правда",
                isCorrect: false
            },
        ],
        explanation: "Судебник 1550 года был первым в русской истории единым сводом законов, обнародованным от имени царя. Он ограничивал власть наместников, регламентировал судопроизводство и усилил контроль центра над местным управлением."
    },
    {
        id: 10,
        question: "Как называлась первая в России регулярная воинская часть, созданная Иваном Грозным в 1550 году и вооружённая огнестрельным оружием?",
        image: "",
        options: [
            {
                option: "Казачье войско",
                isCorrect: false
            },
            {
                option: "Дворянское ополчение",
                isCorrect: false
            },
            {
                option: "Стрелецкое войско",
                isCorrect: true
            },
            {
                option: "Регимент иноземного строя",
                isCorrect: false
            },
        ],
        explanation: "Стрельцы стали первым постоянным пехотным войском в России, получавшим денежное и хлебное жалование. Они сыграли ключевую роль в военных походах Ивана IV и несли гарнизонную службу."
    }
];

export const questions1613_1721 = [
    {
        id: 1,
        question: "Какой царь, первый из династии Романовых, был избран Земским собором в 1613 году?",
        image: "",
        options: [
            {
                option: "Алексей Михайлович",
                isCorrect: false
            },
            {
                option: "Михаил Фёдорович",
                isCorrect: true
            },
            {
                option: "Фёдор Алексеевич",
                isCorrect: false
            },
            {
                option: "Иван V",
                isCorrect: false
            },
        ],
        explanation: "Михаил Романов был избран на царство в 16 лет, что положило конец Смутному времени. Его отец, патриарх Филарет, фактически правил вместе с ним."
    },
    {
        id: 2,
        question: "Какой церковный раскол произошёл в правление Алексея Михайловича и связан с реформами патриарха Никона?",
        image: "",
        options: [
            {
                option: "Раскол между католиками и протестантами",
                isCorrect: false
            },
            {
                option: "Раскол Русской православной церкви (старообрядчество)",
                isCorrect: true
            },
            {
                option: "Отделение Грузинской православной церкви",
                isCorrect: false
            },
            {
                option: "Учреждение Синода",
                isCorrect: false
            },
        ],
        explanation: "Реформы Никона по унификации богослужебных книг и обрядов по греческому образцу вызвали сопротивление части духовенства и мирян (старообрядцев), что привело к расколу."
    },
    {
        id: 3,
        question: "Какое крупнейшее казацко-крестьянское восстание произошло в 1670–1671 годах под предводительством Степана Разина?",
        image: "",
        options: [
            {
                option: "Восстание Болотникова",
                isCorrect: false
            },
            {
                option: "Восстание Пугачёва",
                isCorrect: false
            },
            {
                option: "Восстание Степана Разина",
                isCorrect: true
            },
            {
                option: "Медный бунт",
                isCorrect: false
            },
        ],
        explanation: "Восстание охватило огромные территории Поволжья и Дона. Основными движущими силами были казаки, крестьяне и народы Поволжья, недовольные усилением крепостного гнёта."
    },
    {
        id: 4,
        question: "Как называется эпоха масштабных реформ Петра I, превративших Россию в ведущую европейскую державу?",
        image: "",
        options: [
            {
                option: "Эпоха Просвещения",
                isCorrect: false
            },
            {
                option: "Петровские реформы",
                isCorrect: true
            },
            {
                option: "Великие либеральные реформы",
                isCorrect: false
            },
            {
                option: "Эпоха дворцовых переворотов",
                isCorrect: false
            },
        ],
        explanation: "Преобразования Петра I (конец XVII – первая четверть XVIII в.) затронули все сферы жизни: армию, флот, государственное управление, экономику, культуру, быт."
    },
    {
        id: 5,
        question: "После какой войны Россия была провозглашена империей, а Пётр I принял титул императора?",
        image: "",
        options: [
            {
                option: "Ливонская война",
                isCorrect: false
            },
            {
                option: "Семилетняя война",
                isCorrect: false
            },
            {
                option: "Северная война",
                isCorrect: true
            },
            {
                option: "Русско-турецкая война 1710–1713",
                isCorrect: false
            },
        ],
        explanation: "После победы в Северной войне (1700–1721) со Швецией и заключения Ништадтского мира Сенат и Синод присвоили Петру I титулы Императора Всероссийского и Отца Отечества."
    },
    {
        id: 6,
        question: "Какой новый орган власти, созданный Петром I в 1711 году, стал высшим правительственным учреждением?",
        image: "",
        options: [
            {
                option: "Боярская дума",
                isCorrect: false
            },
            {
                option: "Приказ тайных дел",
                isCorrect: false
            },
            {
                option: "Верховный тайный совет",
                isCorrect: false
            },
            {
                option: "Правительствующий Сенат",
                isCorrect: true
            },
        ],
        explanation: "Сенат был создан как высший орган по делам законодательства и государственного управления на время отлучек Петра I, но затем стал постоянным учреждением."
    },
    {
        id: 7,
        question: "Какой город был основан Петром I в 1703 году и позднее стал столицей Российской империи?",
        image: "",
        options: [
            {
                option: "Москва",
                isCorrect: false
            },
            {
                option: "Севастополь",
                isCorrect: false
            },
            {
                option: "Санкт-Петербург",
                isCorrect: true
            },
            {
                option: "Одесса",
                isCorrect: false
            },
        ],
        explanation: "Санкт-Петербург был заложен как крепость и порт на отвоёванных у шведов землях. С 1712 года сюда был перенесён царский двор и столица государства."
    },
    {
        id: 8,
        question: "Какой указ Петра I от 1722 года ввёл новую систему продвижения на государственной службе?",
        image: "",
        options: [
            {
                option: "Указ о единонаследии",
                isCorrect: false
            },
            {
                option: "Табель о рангах",
                isCorrect: true
            },
            {
                option: "Указ о престолонаследии",
                isCorrect: false
            },
            {
                option: "Генеральный регламент",
                isCorrect: false
            },
        ],
        explanation: "«Табель о рангах» устанавливала 14 рангов (классов) для военных, статских (гражданских) и придворных чинов. Продвижение зависело от личных заслуг, а не только от знатности рода."
    },
    {
        id: 9,
        question: "Какой высший церковный орган был создан Петром I в 1721 году вместо патриаршества?",
        image: "",
        options: [
            {
                option: "Московская патриархия",
                isCorrect: false
            },
            {
                option: "Святейший Правительствующий Синод",
                isCorrect: true
            },
            {
                option: "Коллегия духовных дел",
                isCorrect: false
            },
            {
                option: "Консистория",
                isCorrect: false
            },
        ],
        explanation: "Упразднив патриаршество, Пётр I подчинил церковь государству. Синод стал государственным учреждением по управлению церковными делами во главе с обер-прокурором."
    },
    {
        id: 10,
        question: "Какой город стал первым в России морским портом на Балтийском море, отвоёванным у Швеции в 1702 году?",
        image: "",
        options: [
            {
                option: "Ревель (Таллин)",
                isCorrect: false
            },
            {
                option: "Нотебург (Шлиссельбург)",
                isCorrect: true
            },
            {
                option: "Нарва",
                isCorrect: false
            },
            {
                option: "Рига",
                isCorrect: false
            },
        ],
        explanation: "Первым важным городом с морским портом на Балтике, отвоеванным у Швеции в 1702 году, стала крепость Нотебург (ныне Шлиссельбург), которую взяли штурмом в октябре 1702 года, стала «ключом к морю» для России, закрепив выход к Балтике. "
    }
];

// 1721–1825
export const questions1721_1825 = [
    {
        id: 1,
        question: "Как называется период с 1725 по 1762 год, когда смена власти часто происходила путём дворцовых переворотов?",
        image: "",
        options: [
            {
                option: "Эпоха регентства",
                isCorrect: false
            },
            {
                option: "Эпоха дворцовых переворотов",
                isCorrect: true
            },
            {
                option: "Смутное время",
                isCorrect: false
            },
            {
                option: "Бироновщина",
                isCorrect: false
            },
        ],
        explanation: "После смерти Петра I отсутствие чётких правил престолонаследия привело к борьбе дворянских группировок за власть. На престоле сменилось несколько правителей, опиравшихся на гвардию."
    },
    {
        id: 2,
        question: "Какая императрица правила дольше всех в XVIII веке (1762–1796) и прославилась просвещённым абсолютизмом и расширением территорий?",
        image: "",
        options: [
            {
                option: "Анна Иоанновна",
                isCorrect: false
            },
            {
                option: "Елизавета Петровна",
                isCorrect: false
            },
            {
                option: "Екатерина II Великая",
                isCorrect: true
            },
            {
                option: "Мария Фёдоровна",
                isCorrect: false
            },
        ],
        explanation: "Екатерина II проводила активную внутреннюю (Уложенная комиссия, губернская реформа) и внешнюю политику (разделы Речи Посполитой, русско-турецкие войны). Эпоха её правления считается «золотым веком» русского дворянства."
    },
    {
        id: 3,
        question: "Кто возглавил крупнейшее казацко-крестьянское восстание 1773–1775 годов, охватившее Урал и Поволжье?",
        image: "",
        options: [
            {
                option: "Степан Разин",
                isCorrect: false
            },
            {
                option: "Кондратий Булавин",
                isCorrect: false
            },
            {
                option: "Емельян Пугачёв",
                isCorrect: true
            },
            {
                option: "Иван Болотников",
                isCorrect: false
            },
        ],
        explanation: "Емельян Пугачёв выдавал себя за императора Петра III. Восстание было жестоко подавлено, а Пугачёв казнён в Москве. После него была ликвидирована Запорожская Сечь."
    },
    {
        id: 4,
        question: "В результате какой войны к России в 1783 году был присоединён Крым?",
        image: "",
        options: [
            {
                option: "Русско-турецкая война 1768–1774",
                isCorrect: false
            },
            {
                option: "Русско-турецкая война 1787–1791",
                isCorrect: false
            },
            {
                option: "Крым был присоединён манифестом Екатерины II после предыдущей войны",
                isCorrect: true
            },
            {
                option: "Северная война",
                isCorrect: false
            },
        ],
        explanation: "После победы в русско-турецкой войне 1768–1774 гг. Крымское ханство стало независимым от Османской империи. В 1783 году, воспользовавшись смутой, Екатерина II издала манифест о включении Крыма в состав России."
    },
    {
        id: 5,
        question: "Какой русский полководец не проиграл ни одного сражения и особенно прославился в войнах с Турцией и Францией?",
        image: "",
        options: [
            {
                option: "Михаил Кутузов",
                isCorrect: false
            },
            {
                option: "Александр Суворов",
                isCorrect: true
            },
            {
                option: "Пётр Румянцев",
                isCorrect: false
            },
            {
                option: "Григорий Потёмкин",
                isCorrect: false
            },
        ],
        explanation: "Александр Васильевич Суворов — один из основоположников русского военного искусства. Известен победами при Рымнике, Измаиле, переходом через Альпы. Автор книги «Наука побеждать»."
    },
    {
        id: 6,
        question: "Какое сражение в 1812 году между русской и французской армиями считается самым кровопролитным в однодневных сражениях до Первой мировой войны?",
        image: "",
        options: [
            {
                option: "Смоленское сражение",
                isCorrect: false
            },
            {
                option: "Бородинское сражение",
                isCorrect: true
            },
            {
                option: "Сражение под Малоярославцем",
                isCorrect: false
            },
            {
                option: "Битва под Аустерлицем",
                isCorrect: false
            },
        ],
        explanation: "Бородинская битва (7 сентября 1812 г.) не выявила явного победителя, но нанесла огромный урон армии Наполеона и стала моральной победой русских, предрешившей итог войны."
    },
    {
        id: 7,
        question: "Как называется движение прогрессивного дворянства, организовавшее выступление на Сенатской площади в Петербурге в декабре 1825 года?",
        image: "",
        options: [
            {
                option: "Народники",
                isCorrect: false
            },
            {
                option: "Славянофилы",
                isCorrect: false
            },
            {
                option: "Декабристы",
                isCorrect: true
            },
            {
                option: "Западники",
                isCorrect: false
            },
        ],
        explanation: "Декабристы — участники тайных обществ («Союз спасения», «Союз благоденствия» и др.), которые выступили против самодержавия и крепостного права после смерти Александра I. Восстание было подавлено."
    },
    {
        id: 8,
        question: "Кто стал российским императором после подавления восстания декабристов?",
        image: "",
        options: [
            {
                option: "Александр I",
                isCorrect: false
            },
            {
                option: "Константин Павлович",
                isCorrect: false
            },
            {
                option: "Николай I",
                isCorrect: true
            },
            {
                option: "Александр II",
                isCorrect: false
            },
        ],
        explanation: "Николай I вступил на престол в день восстания 14 декабря 1825 года. Его правление (1825–1855) стало эпохой жёсткой централизации власти, бюрократии и консерватизма («теория официальной народности»)."
    },
    {
        id: 9,
        question: "Какой великий русский учёный-энциклопедист XVIII века основал Московский университет?",
        image: "",
        options: [
            {
                option: "Дмитрий Менделеев",
                isCorrect: false
            },
            {
                option: "Михаил Ломоносов",
                isCorrect: true
            },
            {
                option: "Николай Лобачевский",
                isCorrect: false
            },
            {
                option: "Иван Ползунов",
                isCorrect: false
            },
        ],
        explanation: "Михаил Васильевич Ломоносов внёс вклад в развитие химии, физики, астрономии, филологии, истории. По его проекту в 1755 году был основан Московский университет, носящий ныне его имя."
    },
    {
        id: 10,
        question: "Какой знаменитый памятник, посвящённый победе над Наполеоном, был открыт в Петербурге в 1834 году в правление Николая I?",
        image: "",
        options: [
            {
                option: "Медный всадник",
                isCorrect: false
            },
            {
                option: "Ростральные колонны",
                isCorrect: false
            },
            {
                option: "Александровская колонна",
                isCorrect: true
            },
            {
                option: "Памятник Минину и Пожарскому",
                isCorrect: false
            },
        ],
        explanation: "Александровская колонна на Дворцовой площади (арх. Огюст Монферран) установлена в честь победы императора Александра I над Наполеоном. Венчает её фигура ангела с крестом."
     }
];

// 1825–1917
export const questions1825_1917 = [
    {
        id: 1,
        question: "Какая важнейшая реформа, отменившая крепостное право в России, была проведена императором Александром II в 1861 году?",
        image: "",
        options: [
            {
                option: "Судебная реформа",
                isCorrect: false
            },
            {
                option: "Земская реформа",
                isCorrect: false
            },
            {
                option: "Крестьянская реформа (Отмена крепостного права)",
                isCorrect: true
            },
            {
                option: "Военная реформа",
                isCorrect: false
            },
        ],
        explanation: "Манифест 19 февраля 1861 года даровал личную свободу миллионам крепостных крестьян. Реформа была половинчатой, так как крестьяне получали землю за выкуп и временно оставались в положении «временнообязанных»."
    },
    {
        id: 2,
        question: "Как называется террористическая организация народников, организовавшая убийство Александра II 1 марта 1881 года?",
        image: "",
        options: [
            {
                option: "«Чёрный передел»",
                isCorrect: false
            },
            {
                option: "«Земля и воля» (первая)",
                isCorrect: false
            },
            {
                option: "«Народная воля»",
                isCorrect: true
            },
            {
                option: "«Союз борьбы за освобождение рабочего класса»",
                isCorrect: false
            },
        ],
        explanation: "«Народная воля» (1879–1884) — революционная организация, сделавшая ставку на индивидуальный террор как способ давления на правительство и разжигания революции. После убийства царя была разгромлена."
    },
    {
        id: 3,
        question: "Как называется период в правление Александра III (1881–1894), характеризующийся свёртыванием реформ и усилением консервативно-охранительного курса?",
        image: "",
        options: [
            {
                option: "Контрреформы",
                isCorrect: true
            },
            {
                option: "Эпоха великих реформ",
                isCorrect: false
            },
            {
                option: "Эпоха застоя",
                isCorrect: false
            },
            {
                option: "Просвещённый абсолютизм",
                isCorrect: false
            },
        ],
        explanation: "Контрреформы (усиление административной опеки, ограничение земского и городского самоуправления, ужесточение цензуры, введение института земских начальников) были направлены на стабилизацию общества после убийства Александра II."
    },
    {
        id: 4,
        question: "Какая война 1904–1905 годов показала слабость царского режима и привела к Первой русской революции?",
        image: "",
        options: [
            {
                option: "Русско-турецкая война",
                isCorrect: false
            },
            {
                option: "Первая мировая война",
                isCorrect: false
            },
            {
                option: "Крымская война",
                isCorrect: false
            },
            {
                option: "Русско-японская война",
                isCorrect: true
            },
        ],
        explanation: "Поражение в войне с Японией (Цусима, сдача Порт-Артура) стало сильнейшим ударом по престижу самодержавия и способствовало нарастанию революционных настроений в стране."
    },
    {
        id: 5,
        question: "Какое событие 9 января 1905 года, известное как «Кровавое воскресенье», стало началом Первой русской революции?",
        image: "",
        options: [
            {
                option: "Восстание на броненосце «Потёмкин»",
                isCorrect: false
            },
            {
                option: "Расстрел мирного шествия рабочих к Зимнему дворцу",
                isCorrect: true
            },
            {
                option: "Всеобщая политическая стачка",
                isCorrect: false
            },
            {
                option: "Вооружённое восстание в Москве",
                isCorrect: false
            },
        ],
        explanation: "Мирное шествие во главе со священником Гапоном для подачи петиции царю было расстреляно войсками. Это привело к взрыву народного возмущения и массовым выступлениям по всей стране."
    },
    {
        id: 6,
        question: "Какой документ был издан Николаем II 17 октября 1905 года в разгар революции и даровал гражданские свободы и законодательную Думу?",
        image: "",
        options: [
            {
                option: "Манифест об отречении",
                isCorrect: false
            },
            {
                option: "Манифест «Об усовершенствовании государственного порядка»",
                isCorrect: true
            },
            {
                option: "«Основные государственные законы»",
                isCorrect: false
            },
            {
                option: "Декрет о земле",
                isCorrect: false
            },
        ],
        explanation: "Октябрьский манифест провозглашал свободу совести, слова, собраний, союзов и создание законодательной Государственной думы. Это была первая в российской истории уступка в сторону конституционной монархии."
    },
    {
        id: 7,
        question: "Как назывался представительный законодательный орган, созданный после Манифеста 17 октября 1905 года?",
        image: "",
        options: [
            {
                option: "Учредительное собрание",
                isCorrect: false
            },
            {
                option: "Государственная дума Российской империи",
                isCorrect: true
            },
            {
                option: "Верховный Совет",
                isCorrect: false
            },
            {
                option: "Земский собор",
                isCorrect: false
            },
        ],
        explanation: "Государственная дума работала в 1906–1917 годах. Полномочия I и II Думы были ограничены, их часто распускали. III и IV Думы, избранные по изменённому закону, были более лояльными к правительству."
    },
    {
        id: 8,
        question: "В какой битве Первой мировой войны (1914) русская армия разгромила австро-венгерские войска, но потерпела тяжёлое поражение от немцев в Восточной Пруссии?",
        image: "",
        options: [
            {
                option: "Брусиловский прорыв",
                isCorrect: false
            },
            {
                option: "Галицийская битва",
                isCorrect: true
            },
            {
                option: "Варшавско-Ивангородская операция",
                isCorrect: false
            },
            {
                option: "Сражение при Танненберге",
                isCorrect: false
            },
        ],
        explanation: "Галицийская битва (август-сентябрь 1914) была успешна для России, но параллельно в Восточной Пруссии армия Самсонова потерпела катастрофу под Танненбергом, что сорвало общий стратегический план Антанты."
    },
    {
        id: 9,
        question: "Какое событие в 1917 году привело к падению монархии в России?",
        image: "",
        options: [
            {
                option: "Октябрьская революция",
                isCorrect: false
            },
            {
                option: "Корниловский мятеж",
                isCorrect: false
            },
            {
                option: "Июльский кризис",
                isCorrect: false
            },
            {
                option: "Февральская революция",
                isCorrect: true
            },
        ],
        explanation: "Массовые волнения из-за нехватки хлеба и усталости от войны переросли в всеобщую забастовку и восстание. 2 марта 1917 года Николай II отрёкся от престола. Власть перешла к Временному правительству и Петроградскому Совету."
    },
    {
        id: 10,
        question: "Кто возглавил Временное правительство после Февральской революции в июле 1917 года?",
        image: "",
        options: [
            {
                option: "Георгий Львов",
                isCorrect: false
            },
            {
                option: "Павел Милюков",
                isCorrect: false
            },
            {
                option: "Александр Керенский",
                isCorrect: true
            },
            {
                option: "Лавр Корнилов",
                isCorrect: false
            },
        ],
        explanation: "Александр Керенский, эссер, стал министром-председателем Временного правительства. Его неспособность решить ключевые вопросы (о мире, земле, прекратить войну) привела к росту популярности большевиков."
    }
];

// 1917–1922
export const questions1917_1922 = [
    {
        id: 1,
        question: "Какая партия под руководством Владимира Ленина пришла к власти в результате вооружённого восстания в Петрограде 25–26 октября (7–8 ноября) 1917 года?",
        image: "",
        options: [
            {
                option: "Партия социалистов-революционеров (эсеры)",
                isCorrect: false
            },
            {
                option: "РСДРП(б) — большевики",
                isCorrect: true
            },
            {
                option: "Конституционно-демократическая партия (кадеты)",
                isCorrect: false
            },
            {
                option: "РСДРП (меньшевики)",
                isCorrect: false
            },
        ],
        explanation: "Большевики штурмом взяли Зимний дворец и арестовали Временное правительство. II Всероссийский съезд Советов провозгласил переход власти к Советам и сформировал первое советское правительство — Совнарком во главе с Лениным."
    },
    {
        id: 2,
        question: "Как назывался первый советский правительственный орган, учреждённый II Всероссийским съездом Советов в октябре 1917 года?",
        image: "",
        options: [
            {
                option: "ВЦИК (Всероссийский Центральный Исполнительный Комитет)",
                isCorrect: false
            },
            {
                option: "Совет Народных Комиссаров (СНК)",
                isCorrect: true
            },
            {
                option: "ВЧК (Всероссийская чрезвычайная комиссия)",
                isCorrect: false
            },
            {
                option: "Реввоенсовет",
                isCorrect: false
            },
        ],
        explanation: "Совнарком (СНК) был высшим исполнительным и распорядительным органом. Его первым председателем стал В.И. Ленин. ВЦИК стал высшим законодательным, распорядительным и контролирующим органом между съездами."
    },
    {
        id: 3,
        question: "Какой орган по борьбе с контрреволюцией и саботажем был создан в декабре 1917 года во главе с Феликсом Дзержинским?",
        image: "",
        options: [
            {
                option: "НКВД",
                isCorrect: false
            },
            {
                option: "ГПУ",
                isCorrect: false
            },
            {
                option: "ВЧК",
                isCorrect: true
            },
            {
                option: "ОГПУ",
                isCorrect: false
            },
        ],
        explanation: "Всероссийская чрезвычайная комиссия (ВЧК) стала карательным органом диктатуры пролетариата. Получила неограниченные полномочия по арестам, расстрелам без суда («красный террор») и сыграла ключевую роль в Гражданской войне."
    },
    {
        id: 4,
        question: "Когда было разогнано Учредительное собрание, избранное в ноябре 1917 года для определения государственного устройства России?",
        image: "",
        options: [
            {
                option: "5–6 января 1918 года",
                isCorrect: true
            },
            {
                option: "25 октября 1917 года",
                isCorrect: false
            },
            {
                option: "3 марта 1918 года",
                isCorrect: false
            },
            {
                option: "10 июля 1918 года",
                isCorrect: false
            },
        ],
        explanation: "Учредительное собрание отказалось признать декреты советской власти и власть Советов. После однодневной работы оно было разогнано большевиками с помощью матросов. Это положило конец надеждам на демократическое развитие."
    },
    {
        id: 5,
        question: "Какой мирный договор с Германией был подписан советским правительством в марте 1918 года на крайне невыгодных условиях для России?",
        image: "",
        options: [
            {
                option: "Версальский мир",
                isCorrect: false
            },
            {
                option: "Рижский мир",
                isCorrect: false
            },
            {
                option: "Брестский мир",
                isCorrect: true
            },
            {
                option: "Портсмутский мир",
                isCorrect: false
            },
        ],
        explanation: "Брестский мир (3 марта 1918 г.) означал выход России из Первой мировой войны. Страна теряла огромные территории (Польша, Прибалтика, часть Белоруссии, Украина). Договор был аннулирован после Ноябрьской революции в Германии."
    },
    {
        id: 6,
        question: "Какая новая денежная политика, введённая в 1918–1920 годах, характеризовалась отменой товарно-денежных отношений и натуральной оплатой труда?",
        image: "",
        options: [
            {
                option: "Новая экономическая политика (НЭП)",
                isCorrect: false
            },
            {
                option: "Индустриализация",
                isCorrect: false
            },
            {
                option: "«Военный коммунизм»",
                isCorrect: true
            },
            {
                option: "Коллективизация",
                isCorrect: false
            },
        ],
        explanation: "Политика «военного коммунизма» включала продразвёрстку (принудительное изъятие хлеба у крестьян), национализацию промышленности, запрет частной торговли, трудовую повинность. Была вызвана чрезвычайными условиями Гражданской войны."
    },
    {
        id: 7,
        question: "Кто был одним из самых первых известных руководителей Белого движения на юге России в годы Гражданской войны?",
        image: "",
        options: [
            {
                option: "Александр Колчак",
                isCorrect: false
            },
            {
                option: "Антон Деникин",
                isCorrect: true
            },
            {
                option: "Николай Юденич",
                isCorrect: false
            },
            {
                option4: "Пётр Врангель",
                isCorrect: false
            },
        ],
        explanation: "Генерал Антон Деникин возглавлял Добровольческую армию, а затем Вооружённые силы Юга России (ВСЮР). В 1919 году его войска предприняли неудачный поход на Москву. Позднее командование принял барон Пётр Врангель."
    },
    {
        id: 8,
        question: "Какая крестьянская армия под руководством Нестора Махно сражалась против белых, а затем против красных на Украине?",
        image: "",
        options: [
            {
                option: "Революционно-повстанческая армия Украины",
                isCorrect: true
            },
            {
                option: "Зелёная армия",
                isCorrect: false
            },
            {
                option: "Украинская народная армия (УНР)",
                isCorrect: false
            },
            {
                option: "Кубанское казачье войско",
                isCorrect: false
            },
        ],
        explanation: "Махновцы были анархо-коммунистическим повстанческим движением, выступавшим за «безвластное общество». Они заключали временные союзы с красными против белых, но были враждебны любой государственной власти, что привело к конфликту с большевиками."
    },
    {
        id: 9,
        question: "Какое событие 1918 года считается началом полномасштабной Гражданской войны в России?",
        image: "",
        options: [
            {
                option: "Мятеж Чехословацкого корпуса",
                isCorrect: true
            },
            {
                option: "Выступление Корнилова",
                isCorrect: false
            },
            {
                option: "Штурм Зимнего дворца",
                isCorrect: false
            },
            {
                option: "Расстрел царской семьи",
                isCorrect: false
            },
        ],
        explanation: "Восстание чехословацкого корпуса (май 1918 г.) привело к падению советской власти на огромной территории от Поволжья до Дальнего Востока. Это послужило сигналом к формированию многочисленных антибольшевистских правительств (Комуча, Директории) и началу широкомасштабных боёв."
    },
    {
        id: 10,
        question: "Кем и когда была расстреляна царская семья (Николай II и его близкие)?",
        image: "",
        options: [
            {
                option: "Белыми войсками при отступлении из Екатеринбурга",
                isCorrect: false
            },
            {
                option: "По решению Уральского областного совета в июле 1918 года",
                isCorrect: true
            },
            {
                option: "В Москве по приговору суда",
                isCorrect: false
            },
            {
                option: "Во время штурма Ипатьевского дома красноармейцами",
                isCorrect: false
            },
        ],
        explanation: "В ночь с 16 на 17 июля 1918 года в подвале дома Ипатьева в Екатеринбурге по решению местных советских властей (с санкции центра) были расстреляны бывший император Николай II, его семья и слуги. Официально о расстреле было объявлено только в 1926 году."
    }
];

// 1922–1945
export const questions1922_1945 = [
    {
        id: 1,
        question: "В каком году был образован Союз Советских Социалистических Республик (СССР)?",
        image: "",
        options: [
            {
                option: "1917",
                isCorrect: false
            },
            {
                option: "1922",
                isCorrect: true
            },
            {
                option: "1924",
                isCorrect: false
            },
            {
                option: "1936",
                isCorrect: false
            },
        ],
        explanation: "СССР был образован 30 декабря 1922 года на I Всесоюзном съезде Советов. В его состав первоначально вошли РСФСР, Украинская ССР, Белорусская ССР и Закавказская СФСР."
    },
    {
        id: 2,
        question: "Какая экономическая политика, сменившая «военный коммунизм», была введена в 1921 году и действовала до конца 1920-х?",
        image: "",
        options: [
            {
                option: "Индустриализация",
                isCorrect: false
            },
            {
                option: "Коллективизация",
                isCorrect: false
            },
            {
                option: "Новая экономическая политика (НЭП)",
                isCorrect: true
            },
            {
                option: "Пятилетки",
                isCorrect: false
            },
        ],
        explanation: "НЭП предполагала частичное возрождение рыночных отношений (замена продразвёрстки продналогом, разрешение частной торговли и мелкого предпринимательства), что позволило восстановить экономику после войны и разрухи."
    },
    {
        id: 3,
        question: "Как называется процесс создания в СССР крупной промышленности, ускоренно проводившийся с конца 1920-х годов?",
        image: "",
        options: [
            {
                option: "Коллективизация",
                isCorrect: false
            },
            {
                option: "Индустриализация",
                isCorrect: true
            },
            {
                option: "Национализация",
                isCorrect: false
            },
            {
                option: "Кооперация",
                isCorrect: false
            },
        ],
        explanation: "Индустриализация (первые пятилетки) была направлена на превращение СССР из аграрной в индустриальную державу. Акцент делался на тяжёлую промышленность (металлургия, машиностроение, ВПК)."
    },
    {
        id: 4,
        question: "Как назывался процесс объединения единоличных крестьянских хозяйств в колхозы, сопровождавшийся раскулачиванием?",
        image: "",
        options: [
            {
                option: "Индустриализация",
                isCorrect: false
            },
            {
                option: "Коллективизация",
                isCorrect: true
            },
            {
                option: "Национализация земли",
                isCorrect: false
            },
            {
                option: "Освоение целины",
                isCorrect: false
            },
        ],
        explanation: "Коллективизация (конец 1920-х – 1930-е гг.) проводилась насильственными методами. Целью было установление государственного контроля над производством хлеба и создание ресурсов для индустриализации. Привела к голоду 1932–1933 гг."
    },
    {
        id: 5,
        question: "Какой новый высший закон (конституция) СССР был принят в 1936 году и получил неофициальное название «сталинская»?",
        image: "",
        options: [
            {
                option: "Конституция первого в мире социалистического государства",
                isCorrect: false
            },
            {
                option: "Конституция РСФСР",
                isCorrect: false
            },
            {
                option: "Конституция СССР",
                isCorrect: true
            },
            {
                option: "Декрет о законах",
                isCorrect: false
            },
        ],
        explanation: "Конституция 1936 года декларировала победу социализма, всеобщее равное избирательное право, права трудящихся. Однако на практике её положения (о свободах, неприкосновенности личности) грубо нарушались в условиях массовых репрессий."
    },
    {
        id: 6,
        question: "Как назывался период массовых политических репрессий в СССР во второй половине 1930-х годов?",
        image: "",
        options: [
            {
                option: "Дело врачей",
                isCorrect: false
            },
            {
                option: "Красный террор",
                isCorrect: false
            },
            {
                option: "Большой террор",
                isCorrect: true
            },
            {
                option: "Смутное время",
                isCorrect: false
            },
        ],
        explanation: "«Большой террор» (1937–1938) — пик сталинских репрессий, характеризовавшийся массовыми арестами, расстрелами и заключением в лагеря партийных, хозяйственных и военных кадров, а также рядовых граждан по обвинениям в «контрреволюционной деятельности»."
    },
    {
        id: 7,
        question: "Какой договор о ненападении, включавший секретный протокол о разграничении сфер влияния, СССР подписал с Германией в августе 1939 года?",
        image: "",
        options: [
            {
                option: "Брестский пакт",
                isCorrect: false
            },
            {
                option: "Пакт Молотова–Риббентропа",
                isCorrect: true
            },
            {
                option: "Союзный договор",
                isCorrect: false
            },
            {
                option: "Брестский мир",
                isCorrect: false
            },
        ],
        explanation: "Договор о ненападении между СССР и Германией от 23 августа 1939 года дал СССР время на подготовку к войне и позволил присоединить Западную Украину, Западную Белоруссию, Прибалтику, Бессарабию. Секретный протокол разделял Восточную Европу на сферы влияния."
    },
    {
        id: 8,
        question: "Какое сражение Великой Отечественной войны (ноябрь 1942 – февраль 1943) стало переломным, после которого стратегическая инициатива перешла к Красной Армии?",
        image: "",
        options: [
            {
                option: "Битва за Москву",
                isCorrect: false
            },
            {
                option: "Сталинградская битва",
                isCorrect: true
            },
            {
                option: "Курская битва",
                isCorrect: false
            },
            {
                option: "Битва за Воронеж",
                isCorrect: false
            },
        ],
        explanation: "Сталинградская битва завершилась окружением и капитуляцией 6-й армии вермахта под командованием фельдмаршала Паулюса. Это было самое крупное поражение Германии на тот момент, оказавшее огромное психологическое воздействие на весь мир."
    },
    {
        id: 9,
        question: "Какое крупнейшее танковое сражение Второй мировой войны произошло летом 1943 года на Курской дуге?",
        image: "",
        options: [
            {
                option: "Под Прохоровкой",
                isCorrect: true
            },
            {
                option: "Под Бородино",
                isCorrect: false
            },
            {
                option: "Под Уманью",
                isCorrect: false
            },
            {
                option: "Под Курском",
                isCorrect: false
            },
        ],
        explanation: "Сражение под Прохоровкой 12 июля 1943 года, в котором с обеих сторон участвовало до 1200 танков и САУ, стало кульминацией Курской битвы. Хотя потери Красной Армии были велики, немецкое наступление было окончательно остановлено."
    },
    {
        id: 10,
        question: "Когда над Рейхстагом в Берлине было водружено Знамя Победы, символизирующее окончание Великой Отечественной войны?",
        image: "",
        options: [
            {
                option: "8 мая 1945",
                isCorrect: false
            },
            {
                option: "9 мая 1945",
                isCorrect: false
            },
            {
                option: "1 мая 1945",
                isCorrect: false
            },
            {
                option: "30 апреля 1945",
                isCorrect: true
            },
        ],
        explanation: "Штурмовой флаг 150-й стрелковой дивизии был водружён на крыше Рейхстага рано утром 1 мая 1945 года разведчиками М. А. Егоровым и М. В. Кантария. Акт о безоговорочной капитуляции Германии был подписан в ночь с 8 на 9 мая."
    }
];



export const allQuestions = [questions862_1480, questions1480_1613, questions1613_1721,
     questions1721_1825, questions1825_1917, questions1917_1922, questions1922_1945];

export function getRandomQuestions(count) {
    let questions = [];
    for (let i = 0; i < count; i++) {
        const randomEraIndex = getRandomInt(0, allQuestions.length - 1);
        const randomEra = allQuestions[randomEraIndex];
        const randomQuestionIndex = getRandomInt(0, randomEra.length - 1);
        questions.push(randomEra[randomQuestionIndex].question);
    }
    return questions;
}

export function getCertainTopic(count, period) {
    const currentPeriod = allQuestions[period];
    if (count <= currentPeriod.length) {
        const shuffled = [...currentPeriod];
        for (let i = shuffled.length - 1; i > 0; i--) {
            const j = Math.floor(Math.random() * (i + 1));
            [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
        }
                return shuffled.slice(0, count);
    }

    return currentPeriod;
}

export function getRandomInt(min, max) {
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min + 1)) + min;
}
